# Load Sky130 liberty
read_liberty -lib /home/prawns/.volare/volare/sky130/versions/c6d73a35f524070e85faff4a6a9eef49553ebc2b/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

# Read SystemVerilog files
read_verilog -sv apb_i2c.sv i2c_master_bit_ctrl.sv i2c_master_byte_ctrl.sv i2c_master_defines.sv

# Synthesize with top module
synth -top apb_i2c

# Map to standard cells
dfflibmap -liberty /home/prawns/.volare/volare/sky130/versions/c6d73a35f524070e85faff4a6a9eef49553ebc2b/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty /home/prawns/.volare/volare/sky130/versions/c6d73a35f524070e85faff4a6a9eef49553ebc2b/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

# Print final stats (cell count, area, etc.)
stat -top apb_i2c -liberty /home/prawns/.volare/volare/sky130/versions/c6d73a35f524070e85faff4a6a9eef49553ebc2b/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

# Write synthesized netlist
write_verilog -noattr apb_i2c_synth.v
write_json apb_i2c_synth.json